Repository: parsapanahpoor/BusinessPortal
Catalog: BusinessPortal.Web/Resources/Views/Home/Index.*.resx
Languages: ar_sa

source: Account management
ar_sa: ادارة الحساب

source: AdvertisementCategories
ar_sa: فئات الخدمة

source: Advertising
ar_sa: دعاية

source: aerospace Industries
ar_sa: صناعات الطيران

source: Agriculture
ar_sa: زراعة

source: Agriculture and food industry
ar_sa: الزراعة والصناعات الغذائية

source: air filter
ar_sa: مرشح الهواء

source: America
ar_sa: أمريكا

source: Bitumen and related industries
ar_sa: البيتومين والصناعات ذات الصلة

source: Bronze
ar_sa: برونزية

source: Buildings and building materials
ar_sa: المباني ومواد البناء

source: Buy a subscription
ar_sa: شراء اشتراك

source: Canada
ar_sa: كندا

source: Carpet
ar_sa: السجاد

source: Carpets and handicrafts
ar_sa: السجاد والحرف اليدوية

source: Chemical
ar_sa: المواد الكيميائية

source: Chemical and Pharmaceutical
ar_sa: الكيميائية والصيدلانية

source: China
ar_sa: الصين

source: Clean Energies
ar_sa: طاقات نظيفة

source: Corn
ar_sa: حبوب ذرة

source: Cosmetics
ar_sa: مستحضرات التجميل

source: Cosmetics and Beauty
ar_sa: مستحضرات التجميل والجمال

source: Currency and banking
ar_sa: العملة والمصارف

source: Customs Affairs
ar_sa: شئون الجمارك

source: Digital
ar_sa: رقمي

source: Digital components
ar_sa: المكونات الرقمية

source: Digital goods
ar_sa: بضائع رقميه

source: Dust filter
ar_sa: منقي غبار

source: Electricity
ar_sa: كهرباء

source: Email
ar_sa: بريد الالكتروني

source: Energy
ar_sa: طاقة

source: Engineering
ar_sa: هندسة

source: Finland
ar_sa: فنلندا

source: Food industry
ar_sa: الصناعات الغذائية

source: France
ar_sa: فرنسا

source: Free
ar_sa: حر

source: gas
ar_sa: غاز

source: Germany
ar_sa: ألمانيا

source: Golden
ar_sa: ذهبي

source: Guaranteed sales
ar_sa: مبيعات مضمونة

source: Home Appliances
ar_sa: أجهزة منزلية، رقمي، الرسمية

source: India
ar_sa: الهند

source: Inspection
ar_sa: تكمن

source: International perspective
ar_sa: منظور عالمي

source: Iran
ar_sa: إيران

source: Jewellery
ar_sa: مجوهرات

source: Kuwait
ar_sa: الكويت

source: Landline phone number
ar_sa: رقم الهاتف الثابت

source: LatestProducts
ar_sa: أحدث المنتجات

source: medical
ar_sa: طبي

source: Medical Equipment
ar_sa: معدات طبية

source: Medicine and therapy
ar_sa: الطب والعلاج

source: Membership plan
ar_sa: الاشتراك

source: Mineral Products
ar_sa: المنتجات المعدنية

source: Minesandmetals
ar_sa: المناجم والمعادن

source: Mobile
ar_sa: التليفون المحمول

source: More
ar_sa: أكثر

source: Normal
ar_sa: طبيعي

source: Official
ar_sa: الرسمية

source: Oil
ar_sa: نفط

source: Oil,gasandpetrochemicals
ar_sa: النفط والغاز والبتروكيماويات

source: Our suggestions
ar_sa: اقتراحاتنا

source: ourcountryportals
ar_sa: بوابات بلادنا

source: Outdoor ventilation fan
ar_sa: مروحة تهوية خارجية

source: PageTitle
ar_sa: مسكن

source: Paper and cellulose industries
ar_sa: صناعات الورق والسليلوز

source: petrochemical products
ar_sa: المنتجات البتروكيماوية

source: petrochemicals
ar_sa: البتروكيماويات

source: Petroleum products
ar_sa: منتجات بترولية

source: Pharmaceutical
ar_sa: الأدوية

source: Products
ar_sa: منتجات

source: ProductsCategories
ar_sa: فئات المنتجات

source: Purchase requests
ar_sa: طلبات الشراء

source: Russia
ar_sa: روسيا

source: Sales offers
ar_sa: عروض البيع

source: See More
ar_sa: شاهد المزيد

source: Services
ar_sa: خدمات

source: silver
ar_sa: فضة

source: Site Link
ar_sa: رابط الموقع

source: Social Medias Links
ar_sa: الوسائط الاجتماعية

source: Software
ar_sa: البرمجيات

source: South Korea
ar_sa: كوريا الجنوبية

source: Split air conditioning
ar_sa: تكييف سبليت

source: Standard
ar_sa: اساسي

source: Steel
ar_sa: صلب

source: Steel and Metals
ar_sa: الصلب والمعادن

source: Sugar
ar_sa: سكر

source: tar
ar_sa: قطران

source: Textiles and clothing
ar_sa: المنسوجات والملابس

source: The highest number of purchase requests
ar_sa: أكبر عدد من طلبات الشراء

source: The highest number of sales offers
ar_sa: أكبر عدد من عروض البيع

source: The latest purchase requests
ar_sa: آخر طلبات الشراء

source: Thread
ar_sa: خيط

source: Transport
ar_sa: النقل

source: United Kingdom
ar_sa: المملكة المتحدة

source: Vehicles, transport and parts
ar_sa: المركبات والنقل وقطع الغيار

source: Water
ar_sa: ماء
